Core/src/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyКонтрагенты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПартииНоменклатуры</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/InformationRegisters/АвтоматическоеПроизводство/АвтоматическоеПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоматическоеПроизводство</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ВидыОперацийСборкаЗапасов/ВидыОперацийСборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСборкаЗапасов</name>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>Разборка</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/Спецификации/Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спецификации</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипСтрокиСостава</name>
      <type>
        <types>EnumRef.ТипыСтрокСоставаСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyНаименованияПоставщиков</name>
      <type>
        <types>CatalogRef.AzRyНаименованияПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПриблизительнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyРезервЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПриоритет</name>
      <type>
        <types>CatalogRef.AzRyСпецификацииПриоритет</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyКоментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/CommonModules/АвтоматическоеПроизводствоСервер/Module.bsl
Процедура СоздатьДокументПроизводстваСПроверкойОстатков(ДокументОбъект) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("АвтоматическоеПроизводство") Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаОстатков 		= ДокументОбъект.Дата - 1;
	Дата 				= ДокументОбъект.Дата;
	Организация 		= ДокументОбъект.Организация;
	СтруктурнаяЕдиница 	= ДокументОбъект.СтруктурнаяЕдиница;
	тзЗапасы 			= ДокументОбъект.Запасы.Выгрузить();
	Автор 				= ДокументОбъект.Автор;
	Подразделение 		= ДокументОбъект.Подразделение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	АвтоматическоеПроизводство.Спецификация КАК Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО (ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура)
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
				
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СборкаЗапасов = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиница = Подразделение;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = СтруктурнаяЕдиница;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЦикла;
	
	Если СборкаЗапасов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Запасы.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка КАК Ссылка,
		|	СпецификацииСостав.НомерСтроки КАК НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава КАК ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура КАК Номенклатура,
		|	СпецификацииСостав.Характеристика КАК Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции КАК КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости КАК ДоляСтоимости,
		|	СпецификацииСостав.Спецификация КАК Спецификация,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТЗапаси", тзЗапасы);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
		
	КонецЦикла;
	
	Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументПроизводстваБезПроверкиОстатков(ДокументОбъект) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("АвтоматическоеПроизводство") Тогда 
		Возврат;
	КонецЕсли;
	     	
	Дата 				= ДокументОбъект.Дата;
	Организация 		= ДокументОбъект.Организация;
	СтруктурнаяЕдиница 	= ДокументОбъект.СтруктурнаяЕдиница;
	тзЗапасы 			= ДокументОбъект.Запасы.Выгрузить();
	Автор 				= ДокументОбъект.Автор;
	Подразделение 		= ДокументОбъект.Подразделение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура,
		|	тзЗапасы.Количество,
		|	тзЗапасы.ЕдиницаИзмерения,
		|	тзЗапасы.Характеристика
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура,
		|	ВТ_Запасы.Количество КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика,
		|	АвтоматическоеПроизводство.Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
				
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СборкаЗапасов = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиница = Подразделение;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = СтруктурнаяЕдиница; 
		СборкаЗапасов.ДокументАвтоматическогоПроизводства = ДокументОбъект.Ссылка;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЦикла;
	
	Если СборкаЗапасов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗапаси.Номенклатура,
		|	ТЗапаси.Характеристика,
		|	ТЗапаси.Количество
		|ПОМЕСТИТЬ ТЗапасы
		|ИЗ
		|	&ТЗапаси КАК ТЗапаси
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗапасы.Номенклатура,
		|	ТЗапасы.Характеристика,
		|	ТЗапасы.Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ТЗапасы КАК ТЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
	
	
	Запрос.УстановитьПараметр("ТЗапаси", тзЗапасы);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
		
	КонецЦикла;
	
	Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	ДокументОбъект.ДокументАвтоматическогоПроизводства = СборкаЗапасов.Ссылка;
	
КонецПроцедуры

Процедура СоздатьДокументПроизводстваСПроверкойОстатков_ДокументСборкаЗапасав(ДокументОбъект) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("АвтоматическоеПроизводство") Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаОстатков 		= ДокументОбъект.Дата - 1;
	Дата 				= ДокументОбъект.Дата;
	Организация 		= ДокументОбъект.Организация;
	СтруктурнаяЕдиница 	= ДокументОбъект.СтруктурнаяЕдиница;
	тзЗапасы 			= ДокументОбъект.Запасы.Выгрузить();
	Автор 				= ДокументОбъект.Автор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	АвтоматическоеПроизводство.Спецификация КАК Спецификация
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО (ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура)
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	ВТ_Запасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И ВТ_Запасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
				
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СборкаЗапасов = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Номенклатуранайдена = Истина;
		СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
		СборкаЗапасов.Автор = Автор;
		СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;

		СборкаЗапасов.Дата = Дата - 1;
		СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		СборкаЗапасов.Организация = Организация;
		СборкаЗапасов.СтруктурнаяЕдиницаПродукции = ДокументОбъект.СтруктурнаяЕдиницаПродукции;
		СборкаЗапасов.СтруктурнаяЕдиница = ДокументОбъект.СтруктурнаяЕдиница;
		СборкаЗапасов.СтруктурнаяЕдиницаОтходов = ДокументОбъект.СтруктурнаяЕдиницаОтходов;
		СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = ДокументОбъект.СтруктурнаяЕдиницаЗапасов;
		СборкаЗапасов.ДокументАвтоматическогоПроизводства = ДокументОбъект.Ссылка;
		СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЦикла;
	
	Если СборкаЗапасов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОстатков,
		|			&Организация = Организация
		|				И &СтруктурнаяЕдиница = СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК а)) КАК ЗапасыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	-(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ТаблицаЗапасы
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Запасы.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Запасы.Характеристика = ВТ_Остатки.Характеристика
		|ГДЕ
		|	(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ВТ_Запасы.Количество) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецификацииСостав.Ссылка КАК Ссылка,
		|	СпецификацииСостав.НомерСтроки КАК НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава КАК ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура КАК Номенклатура,
		|	СпецификацииСостав.Характеристика КАК Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции КАК КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости КАК ДоляСтоимости,
		|	СпецификацииСостав.Спецификация КАК Спецификация,
		|	СУММА(СпецификацииСостав.Количество / СпецификацииСостав.КоличествоПродукции * ТаблицаЗапасы.Количество) КАК Количество
		|ИЗ
		|	ТаблицаЗапасы КАК ТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеПроизводство КАК АвтоматическоеПроизводство
		|		ПО ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура,
		|	Справочник.Спецификации.Состав КАК СпецификацииСостав,
		|	Справочник.Спецификации КАК Спецификации
		|ГДЕ
		|	ТаблицаЗапасы.Номенклатура = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Владелец = АвтоматическоеПроизводство.Номенклатура
		|	И Спецификации.Состав.Ссылка = СпецификацииСостав.Ссылка
		|	И ТаблицаЗапасы.Характеристика = АвтоматическоеПроизводство.Характеристика
		|	И СпецификацииСостав.Ссылка = АвтоматическоеПроизводство.Спецификация
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацииСостав.Ссылка,
		|	СпецификацииСостав.НомерСтроки,
		|	СпецификацииСостав.ТипСтрокиСостава,
		|	СпецификацииСостав.Номенклатура,
		|	СпецификацииСостав.Характеристика,
		|	СпецификацииСостав.ЕдиницаИзмерения,
		|	СпецификацииСостав.КоличествоПродукции,
		|	СпецификацииСостав.ДоляСтоимости,
		|	СпецификацииСостав.Спецификация";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СборкаЗапасов.Запасы.Загрузить(Результат.Выгрузить());
		
	КонецЦикла;
	
	Если Номенклатуранайдена Тогда 
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	ДокументОбъект.ДокументАвтоматическогоПроизводства = СборкаЗапасов.Ссылка;
	
КонецПроцедуры
